tap "felixkratz/formulae"
tap "nikitabobko/tap"

# Shell & terminal
brew "powerlevel10k"
brew "zsh-autosuggestions"
brew "eza"
brew "starship"

# Dev tools
brew "neovim"
brew "vim"
brew "lazygit"
brew "gh"
brew "git"
brew "yadm"
brew "cmake"
brew "make"
brew "wget"

# Languages & runtimes
brew "node"
brew "go"
brew "rust"
brew "pyenv"

# System & monitoring
brew "btop"
brew "neofetch"
brew "coreutils"
brew "osx-cpu-temp"

# Fun
brew "asciiquarium"
brew "nethack"

# Casks
cask "nikitabobko/tap/aerospace"
cask "font-hack-nerd-font"
cask "ghostty"
cask "raycast"
cask "stats"
