antfu.goto-alias
antfu.iconify
antfu.pnpm-catalog-lens
antfu.unocss
anthropic.claude-code
beauallison.brew-services
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
editorconfig.editorconfig
figma.figma-vscode-extension
github.copilot-chat
illixion.vscode-vibrancy-continued
lokalise.i18n-ally
mikestead.dotenv
mohdzaid.vscode-cursor-theme
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
openai.openai-chatgpt-adhoc
redhat.vscode-yaml
ritwickdey.liveserver
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
subframe7536.custom-ui-style
usernamehw.errorlens
vitest.explorer
vue.volar
yzhang.markdown-all-in-one
